#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_s3_bucket.fm-terra-s3,
  on s3.tf line 1, in resource "aws_s3_bucket" "fm-terra-s3":
   1: resource "aws_s3_bucket" "fm-terra-s3" {

Use the aws_s3_bucket_versioning resource instead

(and one more similar warning elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ssm_parameter.bard: Refreshing state... [id=bard1212]
aws_dynamodb_table.basic-dynamodb-table: Refreshing state... [id=GameScores]
aws_s3_bucket.fm-terra-s3: Refreshing state... [id=fm-terra-s3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.example will be created
  + resource "aws_dynamodb_table" "example" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "exampleHashKey"
      + id               = (known after apply)
      + name             = "example-name"
      + read_capacity    = 10
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 10

      + attribute {
          + name = "exampleHashKey"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_dynamodb_table_item.example will be created
  + resource "aws_dynamodb_table_item" "example" {
      + hash_key   = "exampleHashKey"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + exampleHashKey = {
                  + S = "something"
                }
              + four           = {
                  + N = "44444"
                }
              + one            = {
                  + N = "11111"
                }
              + three          = {
                  + N = "33333"
                }
              + two            = {
                  + N = "22222"
                }
            }
        )
      + table_name = "example-name"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.fm-terra-s3,
  on s3.tf line 1, in resource "aws_s3_bucket" "fm-terra-s3":
   1: resource "aws_s3_bucket" "fm-terra-s3" {

Use the aws_s3_bucket_versioning resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @fabiomaster01, Action: `pull_request`*